tutorials/combustion/coldEngineFoam/freePiston/0/include/boundaryConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      boundaryConditions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

wall
{
    p
    {
        type            zeroGradient;
    }

    U
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    T
    {
        type            zeroGradient;
    }

    k
    {
        type            kqRWallFunction;
        value           uniform $:internalField.k;
    }

    epsilon
    {
        type            epsilonWallFunction;
        value           uniform $:internalField.epsilon;
    }

    nut
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    alphat
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
}

piston
{
    U
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
